#ifndef CELL_H
#define CELL_H

#include<vector>
#include"xy.h"

class field;

/*  ---------------------------------------------------------------------[<]-
    Class: cell
    Synopsis: Представляє одну клітинку
    ---------------------------------------------------------------------[>]*/
class cell {
    bool is_tree;
    bool is_tent;
    xy self;

public:


    /*  ---------------------------------------------------------------------[<]-
    Constructor: field
    Synopsis: Конструктор з переданим значенням положення клітинки
     ---------------------------------------------------------------------[>]-*/
    cell(int x, int y);


    /*  ---------------------------------------------------------------------[<]-
    Constructor: field
    Synopsis: Конструктор за замовчуванням
     ---------------------------------------------------------------------[>]-*/
    cell();


    /*  ---------------------------------------------------------------------[<]-
    Function: has_tree
    Synopsis: Перевіряє чи в клітинці є дерево
    ---------------------------------------------------------------------[>]-*/
    bool has_tree();


    /*  ---------------------------------------------------------------------[<]-
    Function: has_tent
    Synopsis: Перевіряє чи в клітинці є палатка
    ---------------------------------------------------------------------[>]-*/
    bool has_tent();


/*  ---------------------------------------------------------------------[<]-
    Function: set_tree
    Synopsis: Ставить дерево в клітинці
    ---------------------------------------------------------------------[>]-*/
    void set_tree();


/*  ---------------------------------------------------------------------[<]-
    Function: set_tent
    Synopsis: Ставить палаку в клітинці
    ---------------------------------------------------------------------[>]-*/
    void set_tent();


/*  ---------------------------------------------------------------------[<]-
     Function: remove_tent
    Synopsis: Видаляє палатку з клітинки за наявності
    ---------------------------------------------------------------------[>]-*/
    void remove_tent();


/*  ---------------------------------------------------------------------[<]-
    Function: situation
    Synopsis: Аналізує оточення клітинки та повертає інформацію
    про доступність розміщення намету (суміжні клітинки).
    ---------------------------------------------------------------------[>]-*/
    std::vector<std::pair<int, bool>> situation(field f);
};
#endif