#ifndef GAME_H
#define GAME_H

#include "field.h"

class game{
    public:
    /*  ---------------------------------------------------------------------[<]-
    Function: analyze
    Synopsis: Реалізація демонстрації алгоритму з проміжним кроком
    ---------------------------------------------------------------------[>]-*/
    static void analyze(field field);


    /*  ---------------------------------------------------------------------[<]-
    Function: manual_solve_mode
    Synopsis: Реалізація вирішення задачі користувачем.
    ---------------------------------------------------------------------[>]-*/
    static void manual_solve_mode(field field);


    /*  ---------------------------------------------------------------------[<]-
    Function: main_menu
    Synopsis: Меню для взаємодії користувача з програмою.
    ---------------------------------------------------------------------[>]-*/
    static void main_menu();

    
    /*  ---------------------------------------------------------------------[<]-
    Function: main_menu
    Synopsis: Очищення буфера
    ---------------------------------------------------------------------[>]-*/
    static void clear_input();
};




#endif